###  Essentials ( Minimal )
brew "mas"
tap "buo/cask-upgrade"

###  terminal enhancements
###
brew "coreutils"
brew "curl"
brew "wget"
brew "lsd"
brew "sl"

###  version control systems
###
brew "git"
brew "git-filter-repo"
brew "lazygit"
brew "svn"
cask "gitup"
brew "gh"
brew "gitui"
brew "git-delta"
brew "git-extras"
brew "actionlint"
brew "pre-commit"

###  base build tools
brew "cmake"
brew "cmake-docs"
brew "ninja"
brew "conan"
brew "llvm"

###  doucmentation generator
brew "doxygen"

###  search tools
###
brew "fd"
brew "ripgrep"
brew "tree"
brew "sk"
brew "the_silver_searcher"
brew "sd"
brew "bingrep"

###  cli testing
###
brew "hyperfine"

###  json utils
###
brew "jq"
brew "jql"
brew "jsonnet"
brew "jfrog-cli"

###  yaml utils
###
brew "yq"
brew "yamllint"

###  nodejs
###
brew "node"
brew "yarn"
brew "pnpm"

###  neovim
###
brew "luajit"
brew "tree-sitter"
brew "neovim", args: ["HEAD"]
brew "editorconfig"
brew "markdownlint-cli"

###  terminals
###
cask "alacritty"
cask "kitty"
brew "tmux"
cask "wezterm"

###  java
###
# cask "adoptopenjdk"
cask "temurin"

tap    "homebrew/cask-versions"
  cask "temurin8"
# tap    "adoptopenjdk/openjdk"
#   cask "adoptopenjdk8"

brew "jenv"
brew "maven"
brew "gradle"

###  shell utilities
###
cask "day-o"
cask "hammerspoon"
tap    "koekeishiya/formulae"
  brew "yabai"
  brew "skhd"

###  note takers
###
cask "obsidian"

###  browsers
###
cask "chromium"
brew "chrome-cli"

###  ansible
###
brew "ansible"
brew "ansible-lint"

###  speed
###
brew "parallel"
brew "dsh"
brew "glances"
brew "htop"
brew "ctop"
brew "iftop"

###  Docker & K8s
###
cask "docker"
brew "whalebrew"
brew "docker-slim"
brew "hadolint"

###  virtual machines
###
# brew "terraform"
# brew "terragrunt"
brew "terraform-docs"
brew "terraform-ls"
brew "tflint"
brew "packer"
brew "terrascan"
brew "terraform", link: false
brew "tfenv", conflicts_with: ["terraform"]
brew "cdktf"
brew "tgenv"
brew "tfsec"

###  WebAssembly
###
brew "wasmer"
brew "wasm3"
brew "wapm"

###  Shell SCA Tools
brew "shellcheck"
brew "shfmt"
brew "shellharden"

###  Go Language
###
brew "go"
# tap    "tinygo-org/tools"
# brew   "tinygo"

###  Mint Language
###
tap    "mint-lang/mint-lang"
  brew "mint-lang"

###  language server protocol ( lsp )
###
brew "efm-langserver"
brew "gopls"
brew "rust-analyzer"
brew "deno"
brew "efm-langserver"
brew "bear"
brew "haskell-language-server"

###  language code formaters
###
brew "black"

###  Comms
###
cask "slack"
# cask "webex"

###  Kubernetes
###
brew "k9s"
cask "lens"
brew "helm"
brew "linkerd"
brew "cdk8s"

###  AWS Tools
###
brew "awscli"
brew "aws-okta"
brew "gimme-aws-creds"
brew "aws-iam-authenticator"
cask "session-manager-plugin"
brew "eksctl"
brew "clusterctl"
brew "driftctl"
brew "aws-cdk"

###  Jenkins X
###
tap    "jenkins-x/jx"
  brew "jx"

###  Jekins CLI
###
tap    "jenkins-zh/jcli"
  brew "jcli"

###  Other Things
###
cask "vscodium"
brew "cowsay"
brew "dotenv-linter"

###  system utilities
###
brew "m-cli"

###  Documentation Tools
###
brew "mermaid-cli"
brew "pandoc"

###  Project Tools
###
mas "monday.com", id: 1298450641

###  Graphic Editors
###
brew "gimp"
brew "inkscape"

###  Specialized Linters
###
tap    "shopify/shopify"
  brew "theme-check"

###  fonts
###
brew "fontforge"
tap    "homebrew/cask-fonts"
  cask "font-xkcd"
  # cask "font-fira-code"
  cask "font-fira-code-nerd-font"
  # cask "font-fira-mono"
  cask "font-fira-mono-nerd-font"
  # cask "font-jetbrains-mono"
  cask "font-jetbrains-mono-nerd-font"
  # cask "font-victor-mono"
  cask "font-victor-mono-nerd-font"
  # cask "font-hack"
  cask "font-hack-nerd-font"
  cask "font-source-code-pro"
  cask "font-source-code-pro-for-powerline"
  cask "font-input"
  cask "font-sauce-code-pro-nerd-font"
  cask "font-ubuntu-nerd-font"
  cask "font-ubuntu-mono-nerd-font"
  cask "font-stardos-stencil"
  cask "font-black-ops-one"
  cask "font-lato"
tap    "epk/epk"
  cask "font-sf-mono-nerd-font"
