###  Essentials ( Minimal )
brew "mas"
tap "buo/cask-upgrade"

###  terminal enhancements
###
brew "coreutils"
brew "curl"
brew "wget"
brew "lsd"
# brew "sl"
brew "zinit"
brew "zoxide"
brew "pueue"
brew "choose-rust"
brew "vivid"
brew "dog"
brew "gum"
brew "has"
brew "httpie"
brew "duti"
brew "bash"
brew "lemmeknow"
brew "scriptisto"
brew "rich-cli"
brew "gat"
brew "hck"
brew "sad"
brew "notcursors"
brew "mdcat"
brew "argc"

###  version control systems
###
brew "git"
brew "git-filter-repo"
brew "lazygit"
brew "svn"
cask "gitup"
brew "gh"
brew "glab"
brew "gitui"
brew "git-delta"
brew "git-extras"
# brew "actionlint"
brew "lefthook"
brew "pre-commit"
# brew "gitlint"
brew "codeql"
brew "difftastic"
brew "riff"
brew "sapling"
brew "convco"
brew "legitify"
brew "biodiff"

###  base build tools
brew "cmake"
brew "cmake-docs"
brew "ninja"
brew "conan"
brew "llvm"
brew "meson"

###  documentation generator
brew "doxygen"

###  search tools
###
brew "fd"
brew "ripgrep"
brew "tree"
brew "pstree"
brew "sk"
brew "the_silver_searcher"
brew "sd"
brew "bingrep"
brew "navi"
brew "nap"

###  rust based tool alternatives
###
brew "dust"
brew "procs"
brew "grex"
brew "dysk"
brew "fw"
brew "tzdiff"
brew "killport"

###  cli testing
###
brew "hyperfine"
brew "wrk"
brew "k6"
brew "clitest"

###  json utils
###
brew "jq"
brew "jaq"
brew "jql"
tap    "jmespath/jmespath"
  brew "jmespath/jmespath/jp"
brew "fastgron"

###  artifact repository
###
brew "jfrog-cli"

###  yaml utils
###
brew "yq"
brew "yamllint"

###  xml utils
###
brew "xq"

###  csv utils
###
brew "miller"
brew "dsq"

###  nodejs
###
brew "node"
brew "yarn"
brew "pnpm"

###  neovim
###
brew "luajit"
brew "tree-sitter"
brew "neovim", args: ["HEAD"]
# brew "editorconfig"
# brew "editorconfig-checker"
# brew "markdownlint-cli"
# brew "proselint"
# brew "codespell"
cask "neovide"
brew "typos-cli"

###  zed
brew "zed"

###  doc formats
###
brew "glow"

###  lua
###
brew "luvit"
# brew "stylua"
brew "busted"
brew "lune"

###  nix
###
brew "statix"

###  hermit
###
brew "hermit"

###  terminals
###
cask "alacritty"
cask "kitty"
brew "tmux"
cask "wezterm"
# cask "warp"

###  java
###
# cask "adoptopenjdk"
cask "temurin"
cask "visualvm"

cask "temurin8"
# tap    "adoptopenjdk/openjdk"
#   cask "adoptopenjdk8"

brew "jenv"
brew "maven"
brew "gradle"

brew "jmxterm"
brew "gcviewer"

###  shell utilities
###
cask "day-o"
cask "hammerspoon"
tap    "koekeishiya/formulae"
  brew "yabai"
  brew "skhd"
cask "raycast"
cask "kit"

###  note takers
###
cask "obsidian"

###  browsers
###
cask "chromium"
brew "chrome-cli"
cask "qutebrowser"

###  zathura build support
###
brew "gtk+3"
brew "libmagic"
brew "gtk-mac-integration"
brew "sphinx-doc"
brew "desktop-file-utils"
brew "mupdf"
brew "poppler"

###  ansible
###
brew "ansible"
brew "ansible-lint"

###  speed
###
brew "parallel"
brew "dsh"
brew "glances"
brew "htop"
brew "ctop"
brew "iftop"
brew "bottom"

###  Docker & K8s
###
cask "docker"
brew "whalebrew"
brew "docker-slim"
# brew "hadolint"
brew "podman"
brew "dive"
brew "regclient"

###  virtual machines
###
# brew "terraform"
# brew "terragrunt"
brew "terraform-docs"
# brew "terraform-ls"
# brew "tflint"
brew "packer"
brew "terrascan"
brew "terraform", link: false
brew "tfenv", conflicts_with: ["terraform"]
brew "cdktf"
brew "tgenv"
brew "tfsec"

tap    "hashicorp/tap"
  brew "hashicorp/tap/consul"

###  WebAssembly
###
brew "wasmer"
brew "wasmtime"
brew "wasm3"
brew "wapm"

###  Shell SCA Tools
# brew "shellcheck"
# brew "shfmt"
# brew "shellharden"

###  Go Language
###
brew "go"
# tap    "tinygo-org/tools"
# brew   "tinygo"

###  Mint Language
###
tap    "mint-lang/mint-lang"
  brew "mint-lang"

###  Erlang
###
brew "rebar3"

###  language server protocol ( lsp )
###
brew "efm-langserver"
# brew "gopls"
# brew "rust-analyzer"
brew "deno"
brew "efm-langserver"
brew "bear"
brew "haskell-language-server"
brew "ghcup"
brew "stylish-haskell"
brew "buf"

###  Rust Language
###
brew "rust"
brew "rustup-init"
brew "cargo-nextest"
brew "cargo-outdated"
brew "cargo-audit"
brew "cargo-zigbuild"
brew "duckscript"

###  File Triggers
###
brew "cargo-watch"
brew 'watchexec'
brew 'retry'

###  Python Language
###
brew "poetry"
# brew "black"
# brew "ruff"
# brew "uv"

###  Ruby Language
###
brew "selene"

###  Zig Language
###
brew "zig"

###  Odin Language
###
brew "odin"

###  Please Build Language
###
tap    "though-machine/please"
  brew "please"

###  saltstack
###
brew "salt"
brew "salt-lint"

###  Comms
###
cask "slack"
# cask "webex"
cask "signal"

###  Kubernetes
###
brew "k9s"
cask "lens"
brew "helm"
brew "linkerd"
brew "cdk8s"
brew "kind"
brew "vcluster"
brew "devspace"
brew "krew"
brew "tfk8s"
brew "datree"
brew "yj"
tap    "little-angry-clouds/homebrew-my-brews"
  brew "kbenv"
cask "aptakube"  # not ready for prime time
tap    "FairwindsOps/tap"
  brew "pluto"
tap    "fluxcd/tap"
  brew "fluxcd/tap/flux"
brew "kustomize"
brew "kubevious"
brew "kubectx"
brew "kubent"
brew "cdebug"
brew "kwok"
brew "copa"
brew "kube-linter"
brew "kompose"
brew "skaffold"
# tap    "clowdhaus/taps"
  brew "clowdhaus/taps/eksup"
cask "devpod"
brew "cilium-cli"
tap    "stelligent/tap"
  brew "config-lint"
brew "cmctl"
tap    "stefanprodan/tap"
  brew "timoni"
brew "slsa-verifier"
brew "notation"
brew "kor"
brew "chaoskube"
brew "karmadactl"
brew "kubeseal"
brew "diffoci"
brew "xeol"
brew "kuttl"
brew "oslo"
brew "sloth"
brew "octant"
brew "virtctl"
brew "k8sgpt"
brew "popeye"
brew "glasskube"

###  OCI Containers
###
brew "apko"
brew "ko"

###  Sentry
###
tap    "getsentry/tools"
  brew "sentry-cli"

###  Open Policy Agent
###
brew "opa"
brew "gator"
brew "hof"

###  API Discovery
###
cask "recipeui"

###  Argo
###
brew "argo"
brew "argocd"

###  Generic Makefile Like
###
brew "just"

###  Templating
###
# brew "dhall"
brew "dhall-json"
# brew "dhall-yaml"

###  configuration templating
###
brew "jsonnet"
brew "cue"


###  AWS Tools
###
brew "awscli"
brew "aws-okta"
brew "gimme-aws-creds"
brew "aws-iam-authenticator"
cask "session-manager-plugin"
brew "eksctl"
brew "clusterctl"
brew "driftctl"
brew "aws-cdk"
brew "cfn-lint"
# brew "cfn-flip"
brew "steampipe"

###  oauth
###
brew "oauth2c"

###  Jenkins X
###
tap    "jenkins-x/jx"
  brew "jx"

###  Jenkins CLI
###
# tap    "jenkins-zh/jcli"
#   brew "jcli"

###  Other Things
###
cask "vscodium"
brew "cowsay"
brew "dotenv-linter"
brew "dotter"

###  system utilities
###
brew "m-cli"
brew "totp-cli"
# brew "unxip"
brew "vhs"
brew "cpuid"
whalebrew "gawk"
brew "unar"

###  Documentation Tools
###
brew "mermaid-cli"
brew "pandoc"
brew "graphviz"
brew "d2"

###  Project Tools
###
mas "monday.com", id: 1298450641

###  Graphic Editors
###
brew "gimp"
brew "inkscape"

###  Specialized Linters
###
tap    "shopify/shopify"
  brew "theme-check"

###  Additional stuff
###
# brew "libffi"
brew "watchman"
brew "entr"
brew "libimobiledevice"
brew "ideviceinstaller"
brew "imagemagick"
brew "grunt-cli"
brew "bower"
brew "julia"

# tap    "nickgerace/nickgerace"
#   brew "gfold"

###  Metrics Databases
###
brew "flux"
brew "influxdb"
brew "influxdb-cli"

###  Kotlin
###
brew "detekt"
# brew "ktlint"

###  dotnet
###
brew "dotnet"

###  Formatters
###
# brew "dprint"      # dprint.dev
# brew "prettier"
brew "clang-format"

###  Arbitrary Installer Utilities
###
brew 'bvm'

###  Dagger
###
brew "dagger"

###  Task Runners
###
brew "go-task"

###  Video
###
cask "vlc"

###  Mulesoft Tools
###
cask "anypointstudio"
cask "advancedrestclient"
cask "postman"

###  vanity
###
brew "neofetch"
brew "fastfetch"

###  Bill of Materials
###
brew "spdx-sbom-generator"
tap    "anchore/syft"
  brew "syft"
tap    "anchore/grype"
  brew "grype"
brew "trivy"
brew "bomber"

###  file servers
###
# brew "dufs"

###  Artificial Intellegence
###
brew "ollama"

###  fonts
###
brew "nerdfix"
brew "cfonts"
brew "fontforge"
tap    "homebrew/cask-fonts"
  cask "font-xkcd"
  # cask "font-fira-code"
  cask "font-fira-code-nerd-font"
  # cask "font-fira-mono"
  cask "font-fira-mono-nerd-font"
  # cask "font-jetbrains-mono"
  cask "font-jetbrains-mono-nerd-font"
  # cask "font-victor-mono"
  cask "font-victor-mono-nerd-font"
  # cask "font-hack"
  cask "font-hack-nerd-font"
  cask "font-source-code-pro"
  cask "font-source-code-pro-for-powerline"
  cask "font-input"
  cask "font-sauce-code-pro-nerd-font"
  cask "font-ubuntu-nerd-font"
  cask "font-ubuntu-mono-nerd-font"
  cask "font-stardos-stencil"
  cask "font-black-ops-one"
  cask "font-lato"
  cask "font-ligature-symbols"
  cask "font-port-lligat-sans"
  cask "font-lilex-nerd-font"
  cask "font-intel-one-mono"
  cask "font-intone-mono-nerd-font"
  cask "font-material-symbols"
  cask "font-monaspace"
  cask "font-playwrite-co"
  cask "font-zed-mono"
  cask "font-zed-sans"
tap    "epk/epk"
  cask "font-sf-mono-nerd-font"
