# brew "jc"
brew "jq"
brew "mq"
brew "yq"
brew "xq"
brew "sq"
brew "cyme"
brew "yazi"
brew "resvg"
brew "imagemagick"
brew "htop"
brew "nvtop"
brew "btop"
brew "dtop"
brew "watchexec"
brew "carapace"
brew "otree"
brew "gnu-tar"
brew "csvlens"
brew "parqeye"
brew "fastrace"
brew "devcockpit"
brew "carl"
# uv tool install netshow
# brew "mole"
brew "whosthere"
brew "jqfmt"
brew "fracturedjson"
brew "clock-rs"
brew "rich-cli"
