# tap  "sst/tap"
tap "anomalyco/tap"
  brew "opencode"
  brew "opencode-desktop"

brew "gemini-cli"
brew "qwen-code"
brew "tgpt"
brew "aionui"
brew "copilot-cli"
brew "snyk-agent-scan"
brew "beads"

brew "skillshare"
brew "skills"
brew "llmfit"
brew "paseo"

tap "agent-sh/agnix"
  brew "agnix"

brew "mcp-atlassian"

brew "ollama"
brew "ctx7"

# curl -fsSL https://forgecode.dev/cli | sh

brew "apfel"
tap    "Arthur-Ficial/tap"
  brew "Arthur-Ficial/tap/apfel-mcp"

# uv tool install streamdown
# uv tool install agent-cli-helper

brew "pi-coding-agent"

# uv tool install code-review-graph
