brew "mas"
brew "whalebrew"
brew "coreutils"
brew "git"
brew "git-filter-repo"
brew "lazygit"
brew "ripgrep"
brew "fd"
brew "the_silver_searcher"
brew "parallel"
brew "sk"
brew "dsh"
brew "jfrog-cli"
tap "koekeishiya/formulae"
brew "koekeishiya/formulae/yabai"
brew "koekeishiya/formulae/skhd"
brew "cmake"
brew "ninja"
brew "conan"
brew "doxygen"
brew "llvm"
brew "bear"
brew "node"
brew "yarn"
brew "deno"
brew "jq"
brew "ssh-copy-id"
brew "packer"
brew "terraform"
brew "terraform-docs"
brew "terraform-ls"
brew "yamllint"
brew "tree-sitter"
brew "lua"
brew "luarocks"
brew "luajit", args: ["HEAD"]
tap "neovim/neovim"
brew "neovim", args: ["HEAD"]
cask "vv"
cask "alacritty"
#brew "zsh"
brew "zsh-syntax-highlighting"
brew "bats-core"
brew "tmux"
tap "adoptopenjdk/openjdk"
cask "adoptopenjdk8"
brew "jenv"
brew "groovy"
brew "kotlin"
brew "kotlin-language-server"
brew "ruby"
brew "perl"
brew "poetry"
brew "shellcheck"
brew "rust-analyzer"
brew "efm-langserver"
brew "go"
brew "gopls"
#brew "buildkit"
brew "wget"
brew "htop"
brew "glances"
brew "hyperfine"
brew "fswatch"
brew "watch"
brew "sc-im"
cask "day-o"
cask "meetingbar"
cask "itsycal"
cask "obsidian"
tap "homebrew/cask-fonts"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-fira-mono"
cask "font-fira-mono-nerd-font"
#cask "font-fira-sans"
#cask "font-hasklig"
#cask "font-input"
#cask "font-jetbrains-mono"
#cask "font-jetbrains-mono-nerd-font"
#cask "font-open-dyslexic"
#cask "font-open-dyslexic-nerd-font"
#cask "font-victor-mono"
#cask "font-victor-mono-nerd-font"
#tap "cjbassi/ytop"
#tap "derailed/k9s"
#tap "derailed/popeye"
#tap "facebook/fb"
#tap "homebrew/bundle"
#tap "homebrew/cask"
#tap "homebrew/cask-drivers"
#tap "homebrew/cask-fonts"
#tap "homebrew/core"
#tap "homebrew/services"
#tap "itchyny/tap"
#tap "jenkins-x/jx"
#tap "jenkins-zh/jcli"
#tap "jmespath/jmespath"
#tap "rajatvig/rajat"
#tap "universal-ctags/universal-ctags"
#tap "zaquestion/tap"
#brew "ansible"
#brew "ansible-cmdb"
#brew "ansible-lint"
#brew "autojump"
#brew "bash"
#brew "bat"
#brew "bfg"
#brew "broot"
#brew "cdrtools"
#brew "certbot"
#brew "certigo"
#brew "cgrep"
#brew "cheat"
#brew "check"
#brew "clang-format"
#brew "codequery"
#brew "cppcheck"
#brew "cscope"
#brew "ctop"
#brew "curl"
#brew "dash"
#brew "desk"
#brew "di"
#brew "direnv"
#brew "dive"
#brew "dnstracer"
#brew "docker-clean"
#brew "docker-gen"
#brew "docker-machine"
#brew "docker-machine-driver-xhyve"
#brew "docker-swarm"
#brew "dotnet"
#brew "earthly"
#brew "editorconfig"
#brew "entr"
#brew "exa"
#brew "exercism"
#brew "figlet"
#brew "fish"
#brew "fmt"
#brew "fontforge"
#brew "fping"
#brew "fzf"
#brew "git-extras"
#brew "git-flow-avh"
#brew "git-lfs"
#brew "gitlab-gem"
#brew "gitlab-runner"
#brew "gitleaks"
#brew "go"
#brew "goenv"
#brew "gojq"
#brew "gopass"
#brew "gotags"
#brew "gox"
#brew "gradle"
#brew "gradle-profiler"
#brew "graphviz"
#brew "gron"
#brew "groovy"
#brew "gssh"
#brew "hadolint"
#brew "hashcat"
#brew "helmsman"
#brew "iproute2mac"
#brew "jql"
#brew "jsonnet"
#brew "kakoune"
#brew "kubeless"
#brew "lazydocker"
#brew "lazygit"
#brew "lf"
#brew "libressl"
#brew "maven-completion"
#brew "mercurial"
#brew "miller"
#brew "mksh"
#brew "molecule"
#brew "mono"
#brew "most"
#brew "navi"
#brew "neofetch"
#brew "nmap"
#brew "nushell"
#brew "operator-sdk"
#brew "pandoc"
#brew "pick"
#brew "podman"
#brew "pre-commit"
#brew "prometheus"
#brew "proselint"
#brew "pstree"
#brew "rest-shell"
#brew "rke"
#brew "rpm"
#brew "rust-analyzer"
#brew "salt"
#brew "sk"
#brew "skopeo"
#brew "sonar-scanner"
#brew "subversion"
#brew "tcping"
#brew "tcptraceroute"
#brew "tealdeer"
#brew "terraform_landscape"
#brew "tflint"
#brew "tig"
#brew "tmate"
#brew "tmuxinator"
#brew "tree"
#brew "twoping"
#brew "up"
#brew "vault"
#brew "vifm"
#brew "watchexec"
#brew "watchman"
#brew "websocat"
#brew "yarn"
#brew "zplug"
#brew "zsh-completions"
#brew "zshdb"
#brew "cjbassi/ytop/ytop"
#brew "derailed/k9s/k9s"
#brew "derailed/popeye/popeye"
#brew "itchyny/tap/bed"
#brew "jenkins-x/jx/jx"
#brew "jenkins-zh/jcli/jcli"
#brew "jmespath/jmespath/jp"
#brew "universal-ctags/universal-ctags/universal-ctags", args: ["HEAD"]
#brew "zaquestion/tap/lab"
#cask "chromium"
#cask "dozer"
#cask "hammerspoon"
#cask "joplin"
#cask "rectangle"
#cask "rocket"
#mas "Contacts Sync for Google Gmail", id: 451691288
#mas "iMovie", id: 408981434
#mas "Microsoft Remote Desktop", id: 715768417
whalebrew "whalebrew/whalesay"
