#!/bin/bash
brew "jenv"
brew "neovim"
brew "composer"
cask "temurin@21"
cask "temurin@8"
cask "temurin"
brew "pnpm"
brew "pipx"
brew "deno"
brew "cocoapods"
brew "npm"
brew "llvm"
brew "lld"
brew "luarocks"
brew "fzf"
brew "gh"
brew "yarn"
brew "rust"
brew "rustup-init"
brew "go"
