###  Essentials ( Minimal )
brew "mas"
tap "buo/cask-upgrade"

###  terminals
###
cask "ghostty"
cask "kitty"
cask "wezterm"
cask "alacritty"
brew "tmux"

###  terminal enhancements
###
brew "coreutils"
brew "curl"
brew "wget"
# brew "lsd"
# brew "sl"
brew "zinit"
brew "zoxide"
# brew "pueue"
# brew "choose-rust"
# brew "vivid"
# brew "dog"
# brew "gum"
brew "has"
# brew "httpie"
# brew "duti"
brew "bash"
# brew "lemmeknow"
# brew "scriptisto"
brew "rich-cli"
brew "gat"
# brew "hck"
brew "sad"
# brew "notcursors"
brew "mdcat"
# brew "argc"
brew "direnv"
brew "starship"

###  neovim
brew "neovim"
brew "hevi" # hex viewer

###  version control systems
###
brew "git"
# brew "git-filter-repo"
# brew "lazygit"
# brew "svn"
cask "gitup"
brew "gh"
# brew "glab"
brew "gitui"
# brew "git-delta"
# brew "git-extras"
# # brew "actionlint"
brew "zizmor"
# brew "lefthook"
# brew "pre-commit"
# # brew "gitlint"
# brew "codeql"
brew "difftastic"
# brew "riff"
# brew "sapling"
# brew "convco"
# brew "legitify"
# brew "biodiff"
brew "gitu"
brew "serie"
#
###  base build tools
brew "cmake"
brew "cmake-docs"
brew "action-docs"
brew "ninja"
brew "conan"
brew "llvm"
brew "lld"
brew "gcc"
brew "gcc@13"
# brew "llvm@13"
# brew "meson"
#
# ###  documentation generator
# brew "doxygen"

###  search tools
###
brew "fd"
brew "ripgrep"
brew "tree"
brew "pstree"
brew "sk"
brew "fzf"
# brew "the_silver_searcher"
brew "sd"
# brew "bingrep"
# brew "navi"
# brew "nap"
#
# ###  rust based tool alternatives
# ###
# brew "dust"
# brew "procs"
# brew "grex"
# brew "dysk"
# brew "fw"
# brew "tzdiff"
# brew "killport"
#
###  cli testing
###
brew "hyperfine"
# brew "wrk"
# brew "k6"
# brew "clitest"
#
###  json utils
###
brew "jq"
brew "jc"
brew
# brew "jaq"
# brew "jql"
# tap    "jmespath/jmespath"
#   brew "jmespath/jmespath/jp"
# brew "fastgron"
brew "otree"
#
###  artifact repository
###
brew "jfrog-cli"
#
###  yaml utils
###
brew "yq"
# brew "yamllint"
#
###  xml utils
###
brew "xq"
#
###  sql utils
###
brew "sq"
#
# ###  csv utils
# ###
# brew "miller"
# brew "dsq"
brew "tabiew"
#
###  nodejs
###
brew "node"
brew "yarn"
brew "pnpm"
#
###  neovim
###
brew "luajit"
brew "tree-sitter"
brew "luarocks"
brew "composer"
# brew "neovim", args: ["HEAD"]
# # brew "editorconfig"
# # brew "editorconfig-checker"
# # brew "markdownlint-cli"
# # brew "proselint"
# brew "codespell"
cask "neovide"
# brew "typos-cli"
#
# ###  zed
# brew "zed"
#
# ###  doc formats
# ###
# brew "glow"
#
# ###  lua
# ###
# brew "luvit"
# # brew "stylua"
# brew "busted"
# brew "lune"
#
# ###  nix
# ###
# brew "statix"
#
# ###  hermit
# ###
# brew "hermit"
#
# ###  terminals
# ###
# # cask "warp"
#
###  java
###
# # cask "adoptopenjdk"
cask "temurin"
# cask "visualvm"
#
tap    "homebrew/cask-versions"
  cask "temurin@8"
# # tap    "adoptopenjdk/openjdk"
# #   cask "adoptopenjdk8"
#
brew "jenv"
# brew "maven"
# brew "gradle"
#
# brew "jmxterm"
# brew "gcviewer"
#
###  shell utilities
###
# cask "day-o"
# cask "hammerspoon"
tap    "koekeishiya/formulae"
  brew "yabai"
  brew "skhd"
tap    "nikitabobko/tap"
  cask "aerospace"
tap    "FelixKratz/formulae"
  brew "borders"
  cask "font-sketchybar-app-font"
# cask "raycast"
# cask "kit"
brew "yazi"
brew "cyme"
#
# ###  note takers
# ###
brew "nb"
# cask "obsidian"
#
###  browsers
###
# cask "chromium"
# brew "chrome-cli"
# cask "qutebrowser"
#
# ###  zathura build support
# ###
# brew "gtk+3"
# brew "libmagic"
# brew "gtk-mac-integration"
# brew "sphinx-doc"
# brew "desktop-file-utils"
# brew "mupdf"
# brew "poppler"
#
# ###  ansible
# ###
# brew "ansible"
# brew "ansible-lint"
#
###  speed
###
# brew "parallel"
# brew "dsh"
# brew "glances"
brew "htop"
brew "nvtop"
# brew "ctop"
# brew "iftop"
# brew "bottom"
#
###  Docker & K8s
###
# cask "docker"
# brew "whalebrew"
# brew "docker-slim"
# # brew "hadolint"
# brew "podman"
# brew "dive"
# brew "regclient"
cask "orbstack"
#
###  virtual machines
###
# # brew "terraform"
# # brew "terragrunt"
# brew "terraform-docs"
# # brew "terraform-ls"
# # brew "tflint"
brew "packer"
# brew "terrascan"
# brew "terraform", link: false
brew "tfenv", conflicts_with: ["terraform"]
# brew "cdktf"
brew "tgenv"
# brew "tfsec"
#
# tap    "hashicorp/tap"
#   brew "hashicorp/tap/consul"
#
# ###  WebAssembly
# ###
# brew "wasmer"
# brew "wasmtime"
# brew "wasm3"
# brew "wapm"
brew "wasi-runtimes"
#
# ###  Shell SCA Tools
# # brew "shellcheck"
# # brew "shfmt"
# # brew "shellharden"
#
# ###  Go Language
# ###
brew "go"
# # tap    "tinygo-org/tools"
# # brew   "tinygo"
#
# ###  Mint Language
# ###
# tap    "mint-lang/mint-lang"
#   brew "mint-lang"
#
# ###  Erlang
# ###
# brew "rebar3"
#
# ###  language server protocol ( lsp )
# ###
# brew "efm-langserver"
# # brew "gopls"
# # brew "rust-analyzer"
# brew "deno"
# brew "efm-langserver"
# brew "bear"
# brew "haskell-language-server"
# brew "ghcup"
# brew "stylish-haskell"
# brew "buf"
#
###  Rust Language
###
brew "rust"
brew "rustup-init"
# brew "cargo-nextest"
# brew "cargo-outdated"
# brew "cargo-audit"
# brew "cargo-zigbuild"
# brew "duckscript"
#
# ###  File Triggers
# ###
# brew "cargo-watch"
brew 'watchexec'
# brew 'retry'
#
###  Python Language
###
# brew "poetry"
brew "pipx"
# # brew "black"
# # brew "ruff"
# # brew "uv"
#
# ###  Ruby Language
# ###
brew "ruby"
# brew "selene"
#
# ###  Zig Language
# ###
# brew "zig"
#
# ###  Odin Language
# ###
# brew "odin"
#
# ###  Please Build Language
# ###
# tap    "though-machine/please"
#   brew "please"
#
# ###  saltstack
# ###
# brew "salt"
# brew "salt-lint"
#
###  Comms
###
# cask "slack"
# # cask "webex"
cask "signal"
#
###  Kafka
###
brew "kaskade"
#
###  Network Utilities
###
brew "dug"
#
###  Kubernetes
###
brew "k9s"
# cask "lens"
cask "openlens"
brew "helm"
# brew "linkerd"
# brew "cdk8s"
brew "kind"
# brew "vcluster"
# brew "devspace"
brew "krew"
# brew "tfk8s"
# brew "datree"
# brew "yj"
# tap    "little-angry-clouds/homebrew-my-brews"
  # brew "kbenv"
# cask "aptakube"  # not ready for prime time
# tap    "FairwindsOps/tap"
#   brew "pluto"
tap    "fluxcd/tap"
  brew "fluxcd/tap/flux"
brew "kustomize"
# brew "kubevious"
brew "kubectx"
# brew "kubent"
# brew "cdebug"
# brew "kwok"
# brew "copa"
# brew "kube-linter"
# brew "kompose"
# brew "skaffold"
# # tap    "clowdhaus/taps"
#   brew "clowdhaus/taps/eksup"
# cask "devpod"
brew "cilium-cli"
# tap    "stelligent/tap"
#   brew "config-lint"
# brew "cmctl"
# tap    "stefanprodan/tap"
#   brew "timoni"
# brew "slsa-verifier"
# brew "notation"
# brew "kor"
# brew "chaoskube"
# brew "karmadactl"
# brew "kubeseal"
# brew "diffoci"
# brew "xeol"
# brew "kuttl"
# brew "oslo"
# brew "sloth"
# brew "octant"
# brew "virtctl"
# brew "k8sgpt"
# brew "popeye"
# brew "glasskube"
brew "kubecolor"
brew "crossplane"
tap    "mike-engel/jwt-cli"
  brew "jwt-cli"
brew "steampipe"

#
# ###  OCI Containers
# ###
# brew "apko"
# brew "ko"

# ###  Sentry
# ###
# tap    "getsentry/tools"
#   brew "sentry-cli"
#
# ###  Open Policy Agent
# ###
brew "opa"
# brew "gator"
# brew "hof"
#
# ###  API Discovery
# ###
# cask "recipeui"
brew "openapi-generator"
brew "openapi-tui"
brew "tcptraceroute"
# brew "usage"
#
# ###  Argo
# ###
# brew "argo"
# brew "argocd"
#
# ###  Generic Makefile Like
# ###
brew "just"
brew "pipelight"
#
# ###  Templating
# ###
# # brew "dhall"
# brew "dhall-json"
# # brew "dhall-yaml"
#
# ###  configuration templating
# ###
# brew "jsonnet"
brew "cue"
#
###  Secret Tools
###
brew "teller"
#
###  AWS Tools
###
brew "awscli"
# brew "aws-okta"
brew "okta-aws-cli"
brew "gimme-aws-creds"
# brew "aws-iam-authenticator"
# cask "session-manager-plugin"
# brew "eksctl"
# brew "clusterctl"
# brew "driftctl"
# brew "aws-cdk"
# brew "cfn-lint"
# # brew "cfn-flip"
# brew "steampipe"
tap    "dashlane/tap"
  brew "dashlane-cli"
#
# ###  oauth
# ###
# brew "oauth2c"
#
# ###  Jenkins X
# ###
# tap    "jenkins-x/jx"
#   brew "jx"
#
# ###  Jenkins CLI
# ###
tap    "jenkins-zh/jcli"
  brew "jcli"
#
# ###  Other Things
# ###
# cask "vscodium"
# brew "cowsay"
# brew "dotenv-linter"
# brew "dotter"
#
# ###  system utilities
# ###
# brew "m-cli"
# brew "totp-cli"
# # brew "unxip"
# brew "vhs"
# brew "cpuid"
# whalebrew "gawk"
# brew "unar"
#
# ###  Documentation Tools
# ###
# brew "mermaid-cli"
# brew "pandoc"
# brew "graphviz"
# brew "d2"
#
###  Project Tools
###
# mas "monday.com", id: 1298450641
#
# ###  Graphic Editors
# ###
brew "gimp"
cask "excalidrawz"
# brew "inkscape"
#
# ###  Specialized Linters
# ###
# tap    "shopify/shopify"
#   brew "theme-check"
#
# ###  Additional stuff
# ###
# # brew "libffi"
# brew "watchman"
# brew "entr"
# brew "libimobiledevice"
# brew "ideviceinstaller"
# brew "imagemagick"
# brew "grunt-cli"
# brew "bower"
brew "julia"
#
# # tap    "nickgerace/nickgerace"
# #   brew "gfold"
#
# ###  Metrics Databases
# ###
# brew "flux"
# brew "influxdb"
# brew "influxdb-cli"
#
# ###  Kotlin
# ###
# brew "detekt"
# # brew "ktlint"
#
# ###  dotnet
# ###
# brew "dotnet"
#
# ###  Formatters
# ###
# # brew "dprint"      # dprint.dev
# # brew "prettier"
# brew "clang-format"
#
# ###  Arbitrary Installer Utilities
# ###
# brew 'bvm'
#
# ###  Dagger
# ###
# brew "dagger"
#
# ###  Task Runners
# ###
# brew "go-task"
brew "xc"
#
# ###  Video
# ###
# cask "vlc"
#
# ###  Mulesoft Tools
# ###
# cask "anypointstudio"
# cask "advancedrestclient"
cask "postman"
# cask "postman-cli"
# cask "postman-agent"
#
# ###  vanity
# ###
# brew "neofetch"
# brew "fastfetch"
#
# ###  Bill of Materials
# ###
# brew "spdx-sbom-generator"
# tap    "anchore/syft"
#   brew "syft"
# tap    "anchore/grype"
#   brew "grype"
# brew "trivy"
# brew "bomber"
#
# ###  file servers
# ###
# # brew "dufs"
#
# ###  encryption
# ###
brew "rage"
#
# ###  Artificial Intellegence
# ###
# brew "ollama"
#
###  fonts
###
brew "nerdfix"
brew "cfonts"
brew "fontforge"
# tap    "homebrew/cask-fonts"
  # cask "font-fira-code"
  # cask "font-fira-mono"
  # cask "font-jetbrains-mono"
  # cask "font-hack"
cask "font-darwin"
cask "font-fira-code-nerd-font"
cask "font-fira-mono-nerd-font"
cask "font-hack-nerd-font"
cask "font-intone-mono-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-lilex-nerd-font"
cask "font-material-symbols"
cask "font-monaspace"
cask "font-playwrite-co"
cask "font-port-lligat-sans"
cask "font-sauce-code-pro-nerd-font"
cask "font-source-code-pro"
cask "font-source-code-pro-for-powerline"
cask "font-stardos-stencil"
cask "font-ubuntu-nerd-font"
cask "font-ubuntu-mono-nerd-font"
cask "font-victor-mono"
cask "font-victor-mono-nerd-font"
cask "font-xkcd"
cask "font-zed-mono"
cask "font-zed-sans"
cask "font-black-ops-one"
cask "font-briem-hand"
cask "font-lato"
cask "font-ligature-symbols"
cask "font-input"
cask "font-intel-one-mono"
cask "font-maple-mono-nf"
tap    "epk/epk"
  cask "font-sf-mono-nerd-font"
